Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: ངན་སོང་གིས་ཡིད་བྱུང་བ་རྣམས་དགའ་བར་བྱེད་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་སྙིང་རྗེ་ལས་བྱུང་བའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration that arises from compassion is the concentration that brings joy to those weary of the lower realms.

source: ངན་སོང་རྣམ་པར་སྦྱོང་བའི་ཕྱིར་ཡོངས་སུ་སྐྱོ་བ་མེད་པ་དང་། ཆོས་ཀྱི་སྦྱིན་པ་བྱ་བའི་ཕྱིར་ཡོངས་སུ་སྐྱོ་བ་མེད་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཡོངས་སུ་སྐྱོ་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་སྙིང་རྗེ་ལས་བྱུང་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། །
en: The perfection of insight that arises from compassion is to work untiringly to purify the lower realms, give the gift of the Dharma, and ripen sentient beings.

source: འདི་དག་ནི་སྙིང་རྗེས་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections dedicated through compassion.

source: དེ་ལ་དགའ་བས་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections dedicated through joy?

source: མཆོག་ཏུ་དགའ་བའི་སྔོན་དུ་འགྲོ་བའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་དགའ་བའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on joy is generosity that is preceded by supreme joy.

source: ཤིན་ཏུ་སྦྱངས་པའི་བསྒྲུབ་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་དགའ་བའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on joy is discipline that accomplishes pliancy.

source: ངོ་ཚ་ཤེས་པ་དང་ཁྲེལ་ཡོད་པ་ལས་བྱུང་བའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་དགའ་བ་ལ་དམིགས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience focused on joy is patience that emerges from reticence and modesty.

source: གནོད་སེམས་མེད་པར་བདག་དང་གཞན་བདེ་བར་བྱེད་ལ་ཉེས་པར་མི་སེམས་ཤིང་ལེགས་པར་སེམས་པ་དང་། འགྱོད་པ་དང་། གདུང་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་དགའ་བ་ལ་དམིགས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence focused on joy is to be free from animosity and to give happiness to both oneself and others. Without thinking in flawed ways, one instead thinks in wholesome ways and is free from both regret and yearning.

source: མི་དགའ་བ་རབ་ཏུ་ཞི་བར་འགྱུར་བ་དང་། སེམས་རྣམ་པར་དག་པར་འགྱུར་བ་དང་། ཀུན་ནས་དཀྲིས་པ་སེལ་བར་འགྱུར་བ་དང་། འདོད་ཆགས་སྤོང་བར་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་དགའ་བ་ལ་དམིགས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration focused on joy is pacification of displeasure, purification of the mind, overcoming the fetters, and giving up desire.

source: བཏང་སྙོམས་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཡོངས་སུ་བཟུང་ཞིང་ཆོས་རྣམ་པར་འབྱེད་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་མཚུངས་པར་ལྡན་པ་རྣམ་པར་ཐར་པའི་སྒོ་སྨོན་པ་མེད་པའི་བྱིན་གྱི་རླབས་ཀྱིས་གནས་ཞི་བ་ཐོགས་པ་མེད་པ་ཕྱིན་ཅི་མ་ལོག་པ་གང་ཡིན་པ་དེ་ནི་དགའ་བ་ལས་བྱུང་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight that arises from joy is to uphold the factor of awakening based on equanimity and to be endowed with the factor of awakening that discerns phenomena. Through the blessing from the gateway to liberation pertaining to the wishlessness, this is the unmistaken and unimpeded abode of peace.

source: འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་དགའ་བས་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the bodhisattvas’ six perfections dedicated through joy.

source: དེ་ལ་བཏང་སྙོམས་ཀྱིས་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections dedicated through equanimity?

source: ཆོས་མཉམ་པ་ཉིད་ཀྱི་རྣམ་པར་སྨིན་པ་ལམ་གྱི་རྒྱུད་བཅད་ཅིང་སེམས་མ་གཏུགས་པའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་བཏང་སྙོམས་ཀྱིས་ཡོངས་སུ་བསྔོས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity dedicated through equanimity is generosity that has an inexhaustible mind and that reaches the end of the path of ripening into the equality of phenomena.

source: གདུང་བ་མེད་ཅིང་སྙིང་བརྩེ་བའི་སེམས་ཀྱིས་ཤིན་ཏུ་སྦྱངས་པ་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་མཚུངས་པར་ལྡན་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་བཏང་སྙོམས་ཀྱིས་ཡོངས་སུ་བསྔོས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline dedicated through equanimity is the perfection of discipline that is free from yearning, purified through a loving mind, and associated with the factors of awakening.

source: སེམས་མི་བརྐམ་ཞིང་མཚན་མ་མེད་པ་མངོན་པར་བསྒྲུབས་ལ་ཕྱི་དང་ནང་ལ་དཔྱོད་པ་ལྟད་མོ་སྤངས་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཏང་སྙོམས་ཀྱིས་ཡོངས་སུ་བསྔོས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience dedicated through equanimity is patience that is free from mental craving, accomplishes signlessness, and has given up the spectacle of analyzing outer and inner phenomena.

source: འདུས་བྱས་ཀྱི་ངོ་བོ་ཀུན་ཤེས་པ་དང་ལྡན་པའི་བཏང་སྙོམས་གང་ཡིན་པ་དེ་ནི་བཏང་སྙོམས་ཀྱིས་ཡོངས་སུ་བསྔོས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence dedicated through equanimity is equanimity endowed with understanding of the essence of conditioned things.

source: ཞི་གནས་སྔོན་དུ་འགྲོ་ཞིང་ལྷག་མཐོང་གི་སྟོབས་བསྐྱེད་པ་ཐམས་ཅད་དུ་འགྲོ་བའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བཏང་སྙོམས་ཀྱིས་ཡོངས་སུ་བསྔོས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration dedicated through equanimity is initiated by calm abiding and gives rise to the power of special insight.

source: སྙིང་རྗེ་ཆེན་པོ་ལ་དམིགས་པའི་མཐར་ཕྱིན་པ་ལམ་ཤིན་ཏུ་སྦྱངས་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་བཏང་སྙོམས་ཀྱིས་ཡོངས་སུ་བསྔོས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight dedicated through equanimity is the insight that consists in purification on the path to the final goal that is focused on great compassion.

source: འདི་དག་ནི་བཏང་སྙོམས་ཀྱིས་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections dedicated through equanimity.

source: དེ་ལ་ལོག་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections dedicated through wrong view?

source: དཔེར་ན་བྲམ་ཟེ་བེ་ལ་མ་ཆུ་འགྲམ་གནས་ཡངས་པ་ན་གཞན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་འཐུན་པར་མཆོད་སྦྱིན་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ལོག་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity dedicated through wrong view is like the offerings made by the Brahmin Velāma in an open area by the riverbanks in order to bring others to maturity.

source: དམིགས་པ་ཅན་གྱི་ཚུལ་ཁྲིམས་དེ་བྱེད་ཅིང་སྤྱོད་ལ་བདག་ཏུ་འཛིན་པ་གང་ཡིན་པ་དེ་ནི་ལོག་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline dedicated through wrong view is discipline that involves objective references and is practiced while apprehending a self.

source: བརྟུལ་ཞུགས་ཀྱི་གནས་ཀྱི་ནགས་ཚལ་ཡངས་པ་ན་སྐྱོ་བ་མེད་པར་སྤྱོད་པ་གང་ཡིན་པ་དེ་ནི་ལོག་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience dedicated through wrong view is the untiring practice that is undertaken in large forests where people practice yogic discipline.

source: འཇིག་རྟེན་པའི་བྱ་བ་རྣམས་སྒྲུབ་ཅིང་རིག་བྱེད་ཀྱང་རྟོགས་ལ་ཆ་ལུགས་དེས་གཞན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ལོག་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence dedicated through wrong view is to perform mundane actives and master the Vedas in order to ripen others.

source: བསམ་གཏན་བསྐྱེད་པས་དེའི་ངོ་བོ་ལ་གནས་ཤིང་དེས་མངོན་པར་དགའ་བ་གང་ཡིན་པ་དེ་ནི་ལོག་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration dedicated through wrong view is to develop concentration and rest in that essential state such that one experiences joy.

source: བྲམ་ཟེའི་ཆ་ལུགས་ཀྱིས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་ཅིང་རྗེས་སུ་འཐུན་པར་འཇུག་པ་གང་ཡིན་པ་དེ་ནི་ལོག་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight dedicated through wrong view is to assume the demeanor of a brahmin in order to ripen others and be in a way that accords with them.

source: འདི་དག་ནི་ལོག་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections dedicated through wrong view.

source: དེ་ལ་ཡང་དག་པའི་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections dedicated through correct view?

source: འཇིག་རྟེན་པའི་བྱ་བ་ལ་འཇུག་ཅིང་སྦྱིན་པ་ཡོད་དོ། །མཆོད་སྦྱིན་ཡོད་དོ། །སྦྱིན་སྲེག་ཡོད་དོ། །ལས་ལེགས་པར་བྱས་པ་དང་། ལས་ཉེས་པར་བྱས་པ་རྣམས་ཀྱི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ཡོད་དོ། །ཞེས་གང་དེ་ལྟ་བུའི་སེམས་ཀྱི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་ཡང་དག་པའི་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity dedicated through correct view is generous engagement in mundane actions, accompanied by thoughts such as, ‘There is generosity, there is offering, there is fire offering; the effects of ripened wholesome and unwholesome actions do exist.’

source: སངས་རྒྱས་མ་བྱུང་བ་ན་བྱང་ཆུབ་སེམས་དཔའ་སྡིག་པའི་གྲོགས་པོའི་དབང་གིས་སྡིག་པ་མི་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ཡང་དག་པའི་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline dedicated through correct view is when bodhisattvas do not engage in unwholesome actions encouraged by unwholesome companions—even when no buddha has appeared.

source: དཔེར་ན་རིའི་རྒྱལ་པོ་གངས་ཅན་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནེ་ཙོར་གྱུར་པས་ཤིང་སྐམ་པོ་མི་སྤོང་བ་སྔོན་བདག་འདིར་དགའ་བར་བྱས་པ་གང་ཡིན་པ་དེ་ནི་ཡང་དག་པའི་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience dedicated through correct view is as demonstrated by the Bodhisattva when he was a parrot living in the lofty snow mountains that chose not to leave a withered tree because he recollected how he had previously been happy there.

source: བདག་དང་གཞན་ལ་གནོད་པར་མི་བྱེད་པར་ཞུགས་པའི་ལྟ་བ་ནི་དཔེར་ན་ཚོང་པ་ཨ་ཤུ་ལ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཡང་དག་པའི་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence dedicated through correct view is the view by which one refrains from bringing harm upon oneself and others, as exemplified by the merchant Aśula.

source: ཤེས་རབ་ཀྱིས་ཡོངས་སུ་སྦྱང་བ་བྱས་པའི་བསམ་གཏན་བཞི་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་ཡང་དག་པའི་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration dedicated through correct view is the attainment of the four concentrations purified by means of insight.

source: སྐྱེ་བོ་མང་པོ་ལ་ཕན་པའི་ཕྱིར་ཉེ་བར་གནས་པའི་ཤེས་རབ་ནི་དཔེར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་རྒྱུ་འདི་ལྟར་གཅིག་པུས་ཚིགས་སུ་བཅད་པ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་བཀོད་པ་གང་ཡིན་པ་དེ་ནི་ཡང་དག་པའི་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight dedicated through correct view is the employment of insight for the sake of benefiting many beings, as exemplified by the wandering Bodhisattva, who on his own, composed eighty-four thousand praises.

source: འདི་དག་ནི་ཡང་དག་པའི་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections dedicated through correct view.

source: དེ་ལ་གནས་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections dedicated through the view having support?

source: སངས་རྒྱས་མ་བྱུང་བ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཐ་ན་རྨི་ལམ་ན་ཡང་སེར་སྣའི་སེམས་མི་སྐྱེད་ན། དངོས་སུ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་པ་གང་ཡིན་པ་དེ་ནི་གནས་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity dedicated through the view having support refers to the fact that during a time when no buddha has appeared bodhisattvas will not even develop stinginess in their dreams, and so obviously also not while they are awake.

source: ཐ་ན་སྲོག་འགགས་ཀྱང་ཁ་ན་མ་ཐོ་བ་རྡུལ་ཙམ་ལ་ཡང་བསླབ་པ་ལས་མི་འདའ་བ་གང་ཡིན་པ་དེ་ནི་གནས་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline dedicated through the view having support means to avoid even the most minute negative action, even at the cost of one’s life.

source: ཚེ་རབས་དེ་དང་དེ་དག་ཏུ་མངའ་བདག་ཏུ་གྱུར་པ་ན་ཡང་བཟོད་པའི་རང་བཞིན་དང་ལྡན་པ་ཡིན་ཞིང་མཉེན་པ་གང་ཡིན་པ་དེ་ནི་གནས་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience dedicated through the view having support means to remain patient and tolerant, even if one is repeatedly born as a king.

source: ཚེ་རབས་ཐམས་ཅད་དུ་གཞན་གྱིས་བསྟན་པ་དང་མ་བསྟན་པ་བྱང་ཆུབ་ཀྱི་ཕྱིར་རྗེས་སུ་སྟོན་པ་གང་ཡིན་པ་དེ་ནི་གནས་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence dedicated through the view having support is to teach, throughout one’s lives, both what others have taught before and what no one else has taught.

source: ཚེ་རབས་དེ་དང་དེ་དག་ནི་ལེགས་པར་བསམ་པ་སེམས་པ་ཡིན་ཞིང་ལེགས་པར་སྤྱད་པའི་ལས་བྱེད་ལ་དེ་ནི་ཤིན་ཏུ་དུལ་བའི་རང་བཞིན་དེ་ལྟ་བུར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་གནས་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration dedicated through the view having support is to maintain wholesome thoughts and mind throughout all one’s lives, engaging in positive actions and developing a most gentle nature.

source: སློབ་དཔོན་མེད་པར་འཇིག་རྟེན་པ་དང་འཇིག་རྟེན་ལས་འདས་པའི་བྱ་བ་ཁོང་དུ་ཆུད་ན་སེམས་ཅན་གྱི་ཚོགས་གཞན་ལ་དེ་ལྟ་བུའི་ཡེ་ཤེས་དེ་མེད་ཅིང་གང་གིས་ལུས་ཀྱི་ལས་སེམས་ཅན་དང་འཐུན་པ་གང་ཡིན་པ་དེ་ནི་གནས་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight dedicated through the view having support is to comprehend mundane and supramundane pursuits even without being taught, and so to act harmoniously within groups of sentient beings who lack such wisdom.

source: འདི་དག་ནི་གནས་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections dedicated through the view having support.

source: དེ་ལ་མི་གནས་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections dedicated through the view having no support?

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ཐབས་མཁས་པས་ཡོངས་སུ་ཟིན་པའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་མི་གནས་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity dedicated through the view having no support is generosity embraced by the perfection of insight and skillful means.

source: ལུས་དང་སེམས་ལ་དམིགས་པ་མེད་པའི་སེམས་ཀྱི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་མི་གནས་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་ཚུལ་ཁྲིམས་སོ། །
en: The perfection of discipline dedicated through the view having no support is mental giving without any observation of body or mind.

source: ཕྱིར་མི་ལྡོག་པའི་ས་ལ་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་མི་གནས་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་བཟོད་པའོ། །
en: The perfection of patience dedicated through the view having no support is patience at the level of irreversibility.

source: འདུ་བྱེད་ཐམས་ཅད་ལ་མི་གནས་ཤིང་ཀུན་ནས་དཀྲིས་པ་མེད་པའི་རྩོལ་བ་གང་ཡིན་པ་དེ་ནི་མི་གནས་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་བརྩོན་འགྲུས་སོ། །
en: The perfection of diligence dedicated through the view having no support is effort that is undertaken beyond all formations and fetters.

source: བདག་ཏུ་འདུ་ཤེས་ཀྱང་མེད་ཅིང་བདག་མེད་པར་འདུ་ཤེས་ཀྱང་མེད་ལ། ཕྱི་དང་ནང་ལ་མི་གནས་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་མི་གནས་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་བསམ་གཏན་ནོ། །
en: The perfection of concentration dedicated through the view having no support is concentration that is beyond any notions of self or no self, and that is beyond being supported by outer or inner phenomena.

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་དང་མ་འདྲེས་པའི་ཤེས་རབ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་མངོན་པར་ཞེན་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་མི་གནས་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight dedicated through the view having no support is insight that is not mixed with the Dharma of hearers and solitary buddhas and does not cling to omniscience.

source: འདི་དག་ནི་མི་གནས་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections dedicated through the view having no support.

source: དེ་ལ་གནས་མེད་པར་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections dedicated without support?

source: གང་ཁམས་གསུམ་ལ་མངོན་པར་དགའ་བ་མེད་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དཔེར་ན་མར་མེ་མཛད་ཀྱི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་གནས་མེད་པར་ཡོངས་སུ་བསྔོས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity dedicated without support is the perfection of generosity without any fondness for the three realms, as exemplified by Dīpaṅkara.

source: མ་གཏོགས་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་གནས་མེད་པའི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline without support is discipline that does not omit anything.

source: ཆོས་ཐམས་ཅད་ལ་རློམ་སེམས་མེད་པའི་སེམས་ཀྱི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་གནས་མེད་པའི་བཟོད་པའོ། །
en: Patience without support is patience that is free from conceptualizing any phenomenon.

source: མི་དམིགས་པར་སྤྱོད་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་གནས་མེད་པའི་བརྩོན་འགྲུས་སོ། །
en: Diligence without support is diligent practice beyond observation.

source: བྱང་ཆུབ་སེམས་དཔའ་མཐོང་བའི་ས་ཐོབ་པའི་ཕྱིན་ཅི་མ་ལོག་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་གནས་མེད་པའི་བསམ་གཏན་ནོ། །
en: Concentration without support is the unerring concentration of bodhisattvas who have attained the level of seeing.

source: ཉོན་མོངས་པ་ཟད་པར་འགྱུར་བའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་གནས་མེད་པས་ཡོངས་སུ་བསྔོས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight without support is insight that brings the defilements to exhaustion.

source: འདི་དག་ནི་གནས་མེད་པས་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections dedicated without support.

source: དེ་ལ་ང་རྒྱལ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections concerning pride?

source: བྱང་ཆུབ་སེམས་དཔའ་ང་རྒྱལ་གྱི་བདུད་བཅོམ་ནས་སྦྱིན་པ་སྦྱིན་པར་བྱེད་ཅིང་། སངས་རྒྱས་ཀྱི་ཞིང་ཕུན་སུམ་ཚོགས་པ་སྒྲུབ་པར་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་ང་རྒྱལ་གྱི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity concerning pride is the generosity that is performed by bodhisattvas who vanquish the demon of pride and accomplish a complete buddha realm.

source: ངན་སོང་གསུམ་སྦྱོང་བར་འགྱུར་བའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ང་རྒྱལ་གྱི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline concerning pride is discipline that purifies the three lower realms.

source: མཚན་རྣམ་པར་སྨིན་པར་འགྱུར་བ་དང་། མཛེས་པར་འགྱུར་བའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་ང་རྒྱལ་གྱི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience concerning pride is the patience that ripens the marks of a buddha and attains beauty.

source: ནོར་བུ་རིན་པོ་ཆེའི་ཕྱིར་རྒྱ་མཚོ་ཆེན་པོ་བསྐམ་པར་སྤྲོ་བ་དང་། གང་གིས་རང་གི་ཆོས་མངོན་པར་འབྱུང་བར་བརྩོན་པ་གང་ཡིན་པ་དེ་ནི་ང་རྒྱལ་གྱི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence concerning pride is a willingness to dry up an ocean for the sake of a precious jewel. It is a diligence that manifests one’s own qualities.

source: ཉོན་མོངས་པ་ཟིལ་གྱིས་གནོན་པར་འགྱུར་ཞིང་བསམ་པ་ཇི་ལྟ་བ་བཞིན་ཡེ་ཤེས་སྐྱེ་བར་འགྱུར་བའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་ང་རྒྱལ་གྱི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration concerning pride is concentration that overcomes the defilements and gives rise to wisdom in accordance with one’s wishes.

source: ང་རྒྱལ་དང་། ལྟ་བ་ཀུན་དུ་འཇོམས་པར་འགྱུར་བའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ང་རྒྱལ་གྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight concerning pride is insight that conquers pride and views.

source: འདི་དག་ནི་ང་རྒྱལ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections concerning pride.

source: དེ་ལ་བཟོད་པ་ལས་བྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections arising from patience?

source: བྱང་ཆུབ་ཀྱི་མཐར་འགྲོ་བའི་སེམས་ཀྱི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པ་ལས་བྱུང་བའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of generosity arising from patience is the generous mind that proceeds to the limit of awakening.

source: དཔེར་ན་བདུད་ཀྱིས་སེམས་ཅན་དམྱལ་བ་བསྟན་པས་སྦྱིན་པ་སྦྱིན་པར་བྱེད་པ་བསལ་བར་མི་ནུས་པ་ནི་སྔོན་གྱི་ཚུལ་ལས་ཤེས་པར་བྱ་བ་ལྟ་བུའོ། །
en: This can be understood, for example, from the way Māra in the past tried to stop the Bodhisattva’s practice of generosity by demonstrating the hell realms, but was unsuccessful.

source: ཕྱིར་མི་ལྡོག་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་བཟོད་པ་ལས་བྱུང་བའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline arising from patience is discipline that has become free from regression.

source: དཔེར་ན་རྒྱལ་པོའི་བུ་བསོད་ནམས་འོད་འཕྲོ་འདི་ལྟར་རྣལ་འབྱོར་ལ་མངོན་དུ་ཕྱོགས་པ་སྦྱིན་པ་ལ་དབང་དུ་གྱུར་པ་ཞིག་བྱུང་བས་ཉི་མ་གཅིག་ལ་ཤིང་རྟ་དང་། རྟ་དང་། བཞོན་པ་དང་། གླང་པོ་དང་། གླང་པོ་ཆེ་དང་། དཔག་ཚད་ཁོར་ཡུག་ཙམ་གྱི་གདུགས་དང་། མུ་ཏིག་གི་དོ་ཤལ་ཕྲེང་བ་བརྒྱ་དང་། གོས་སྦྱིན་པ་དང་། རིན་པོ་ཆེའི་ཅོད་པན་དང་། མཆིལ་ལྷམ་སྟོང་ཕྲག་བརྒྱ་རི་བ་དང་། བུད་མེད་སྟོང་ཕྲག་བརྒྱད་ཅུ་དང་། སིལ་སྙན་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དང་། སྐྱེད་མོས་ཚལ་དང་། མིག་སྦྱིན་པ་དང་། མགོ་དང་རྐང་པ་བཅད་ནས་སྦྱིན་པ་སྦྱིན་པར་བྱེད་པ་གང་ན་གང་གི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པ་ལས་བྱུང་བའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience arising from patience is, for example, like the prince Puṇyaraśmi, who was drawn to spiritual practice and became a master of generosity, thus giving away, in a single day, his chariots, horses, mounts, oxen, and elephants; his parasols that covered an entire league; his hundreds of pearl garlands, garments, jewel-studded crowns, priceless boots, eighty thousand maidens, and cymbals; his royal palace with its surrounding areas and parks; and even his own eyes, head, and legs.

source: མི་གནས་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། དཔེར་ན་རྟའི་རྒྱལ་པོ་རྔོག་ལྡན་གྱིས་སེམས་ཅན་རྣམས་སྒྲོལ་བ་ལྟ་བུའོ། །
en: The perfection of diligence is nonabiding diligence, as exemplified by the king of horses called Keśin who freed sentient beings.

source: དགེ་བའི་ཁ་དོག་ཅན་ལུས་ཀྱི་མཚན་ཡོངས་སུ་སྦྱངས་པ་ལས་བྱུང་བའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བཟོད་པ་ལས་བྱུང་བའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration arising from patience is concentration that arises from the purification of the physical marks, which are pure in color.

source: དཔེར་ན་དགེ་སློང་ཡེ་ཤེས་མཆོག་གྲོང་ཁྱེར་དུ་འཇུག་པ་ཞིག་བྱུང་བ་འདུ་ཤེས་ཐ་དད་དུ་མི་བྱེད་ཅིང་སེམས་མཉམ་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་བཟོད་པ་ལས་བྱུང་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight arising from patience is insight that involves an attitude of equality that does not make distinctions, as exemplified by the monk Supreme Wisdom as he entered the city.

source: འདི་ལྟར་ནེ་ཙོའི་སྐྱེས་པའི་རབས་ལས་ཁོང་དུ་ཆུད་པར་བྱ་སྟེ།
en: This can also be understood from the account of the Bodhisattva’s life as a parrot.

source: འདི་དག་ནི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections arising from patience.

source: དེ་ལ་ཕན་འདོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of benefiting?

source: འོད་སྲུང་ལས་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་རྙེད་པ་དང་། བཀུར་སྟིས་དམ་པའི་ཆོས་ནུབ་པར་མ་གྱུར་ཅིག་ཅེས་ཡོངས་སུ་བསྔོས་པ་དང་། སངས་རྒྱས་འོད་སྲུང་ལ་བྲམ་ཟེའི་བུ་སྐར་འོད་སྐྱོང་གིས་རང་གི་ལུས་ཀྱི་གོས་དང་། མེ་ཏོག་སར་པ་ལྔ་དང་མེ་ཏོག་རྙིང་པ་ལྔ་པོ་དག་གིས་མངོན་པར་བཀབ་སྟེ། གང་གི་རྣམ་པར་སྨིན་པས་ལོ་ལྔ་བརྒྱར་དམ་པའི་ཆོས་དང་། ལོ་ལྔ་བརྒྱར་དམ་པའི་ཆོས་ཀྱི་གཟུགས་བརྙན་ཡང་འབར་བ་གང་ཡིན་པ་དེ་ནི་ཕན་འདོགས་པས་ཡོངས་སུ་བསྔོས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity dedicated through benefiting is, for example, like the brahmin Jyotiṣprabha­pāla who practiced pure conduct under the Buddha Kāśyapa. He dedicated his practice with the wish, ‘May all my wealth and veneration serve to ensure the continuous presence of the sacred Dharma.’ He also shielded the Buddha Kāśyapa with his own clothing and five fresh and five withered flowers. The resultant ripening ensured the splendid presence of the sacred Dharma for five hundred years and of its mere reflection for another five hundred years.

source: གཞན་གྱི་ཚུལ་ཁྲིམས་འཆལ་པ་སེལ་བར་འགྱུར་བའི་ཚུལ་ཁྲིམས་ནི་དཔེར་ན་སྐྱེ་མཆེད་མ་ཚང་བ་གཏོང་བ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཕན་འདོགས་པས་ཡོངས་སུ་བསྔོས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline dedicated through benefiting is discipline that dispels corrupted discipline, such as abandoning imperfect dwellings.

source: སྡུག་བསྔལ་ཐོབ་ཀྱང་སྒྱིད་ལུག་པ་མེད་པ་ནི་དཔེར་ན་འགྲོན་པོའི་ཆེད་དུ་རྒྱ་མཚོ་ཆེན་པོའི་ནང་དུ་ཆུ་སྲིན་མ་ཀ་རའི་ཐད་དུ་ཕྱིན་པ་དང་། འབྲོག་དང་ཆུའི་ནང་དུ་ཁྲུ་བརྒྱ་ཙམ་དུ་སོང་བའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་ཕན་འདོགས་པས་ཡོངས་སུ་བསྔོས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience dedicated through benefiting is patience that remains undeterred despite suffering. For example, it is like the being who approached a makara sea monster and dove a hundred fathoms into the depth of the sea to assist travelers.
